areiter128/pstpl-p33c-tdal/p33c_pral/devices/p33c-octansp-08.h
// Function declarations of port pin RD10
#if defined (_TRISD10)
static const P33C_GPIO_t PIN_RD10 = {
    .Properties.Port         = 3,                       ///< Index of device port this device pin is part of (0=A, 1=B, 2=C, 3=D, etc), =-1 if not available
    .Properties.Pin          = 10,                      ///< Index of device pin within its device port (0-15), =-1 if not available
    .Properties.RPid         = 74,                      ///< Remappable Pin ID of this device pin, =-1 if not available
    .Properties.ADCAN        = 18,                      ///< Index of ADC input instance available at this device pin, =-1 if not available
    .Properties.ADCORE       = 7,                       ///< Index of ADC core connected to analog input of this pin, valid range: 0 to 7, =-1 if not available
    .Properties.CMPxIN       = 2,                       ///< Index of comparator input multiplexer channel available at this pin (0=A, 1=B, 2=C, 3=D), =-1 if not available
    .Properties.DAC          = 3,                       ///< Index of DAC instance available at this device pin, =-1 if not available
    .Properties.I2C          = -1,                      ///< (not available)
    .Properties.OPA          = -1,                      ///< (not available)
    .Properties.PGA          = -1,                      ///< (not available)
    .Properties.PG           = -1,                      ///< (not available)
    .Properties.SPI          = -1,                      ///< (not available)
    #ifdef DAC3CONL
    .Objects.DAC             = (P33C_DAC_INSTANCE_t*)&DAC3CONL, ///< Pointer to DAC/Comparator instance data object available at this device pin
    #else
    .Objects.DAC             = NULL,                    ///< (not available)
    #endif
    #if (P33C_I2C_COUNT > 0)
    .Objects.I2C             = NULL,                    ///< Pointer to I2C interface peripheral instance data object available at this device pin
    #endif
    #if (P33C_OPA_COUNT > 0)
    .Objects.OPA             = NULL,                    ///< Pointer to Op-Amp instance data object available at this device pin
    #endif
    #if (P33C_PGA_COUNT > 0)
    .Objects.PGA             = NULL,                    ///< Pointer to Programmable Gain Amplifier instance data object available at this device pin
    #endif
    #if (P33C_PG_COUNT > 0)
    .Objects.PG              = NULL,                    ///< Pointer to PWM Generator peripheral instance data object available at this device pin
    #endif
    #if (P33C_SPI_COUNT > 0)
    .Objects.SPI             = NULL,                    ///< Pointer to SPI interface peripheral instance data object available at this device pin
    #endif
    .Methods.Get            = &__builtin_RD10_Get,      ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
    .Methods.Set            = &__builtin_RD10_Set,      ///< Sets the most recent pin state to logic HIGH
    .Methods.Clear          = &__builtin_RD10_Clear,    ///< Sets the most recent pin state to logic LOW
    .Methods.Toggle         = &__builtin_RD10_Toggle,   ///< Toggles the most recent pin state
    .Methods.SetInput       = &__builtin_RD10_SetInput, ///< Sets the pin direction to high impedance input (no state change)
    .Methods.SetOutput      = &__builtin_RD10_SetOutput, ///< Sets the pin direction to low impedance output (no state change)
    .Methods.SetState       = &__builtin_RD10_SetState, ///< Sets the pin direction to low impedance output (no state change)
    .Methods.Init           = &__builtin_RD10_Init,     ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
    .Methods.Dispose        = &__builtin_RD10_Dispose,  ///< Sets the pin to high impedance input (RESET default)
    .Methods.GetOpenDrain   = &__builtin_RD10_GetOpenDrain, ///< Gets the pin open drain mode
    .Methods.SetOpenDrain   = &__builtin_RD10_SetOpenDrain, ///< Sets the pin open drain mode
    .Methods.GetPullUp      = &__builtin_RD10_GetPullUp, ///< Gets the connection state of the pin's pull up resistor
    .Methods.SetPullUp      = &__builtin_RD10_SetPullUp, ///< Sets the connection state of the pin's pull up resistor
    .Methods.GetPullDown    = &__builtin_RD10_GetPullDown, ///< Gets the connection state of the pin's pull down resistor
    .Methods.SetPullDown    = &__builtin_RD10_SetPullDown, ///< Sets the connection state of the pin's pull down resistor
    .Methods.SetAnalog      = &__builtin_RD10_SetAnalog, ///< Enable analog functions of this pin
    .Methods.SetDigital     = &__builtin_RD10_SetDigital ///< Disable analog functions of this pin
};
#endif // declarations of pin RD10

// Function declarations of port pin RD11
#if defined (_TRISD11)
static const P33C_GPIO_t PIN_RD11 = {
    .Properties.Port         = 3,                       ///< Index of device port this device pin is part of (0=A, 1=B, 2=C, 3=D, etc), =-1 if not available
    .Properties.Pin          = 11,                      ///< Index of device pin within its device port (0-15), =-1 if not available
    .Properties.RPid         = 75,                      ///< Remappable Pin ID of this device pin, =-1 if not available
    .Properties.ADCAN        = 19,                      ///< Index of ADC input instance available at this device pin, =-1 if not available
    .Properties.ADCORE       = 7,                       ///< Index of ADC core connected to analog input of this pin, valid range: 0 to 7, =-1 if not available
    .Properties.CMPxIN       = 2,                       ///< Index of comparator input multiplexer channel available at this pin (0=A, 1=B, 2=C, 3=D), =-1 if not available
    .Properties.DAC          = 2,                       ///< Index of DAC instance available at this device pin, =-1 if not available
    .Properties.I2C          = -1,                      ///< (not available)
    .Properties.OPA          = -1,                      ///< (not available)
    .Properties.PGA          = -1,                      ///< (not available)
    .Properties.PG           = -1,                      ///< (not available)
    .Properties.SPI          = -1,                      ///< (not available)
    #ifdef DAC2CONL
    .Objects.DAC             = (P33C_DAC_INSTANCE_t*)&DAC2CONL, ///< Pointer to DAC/Comparator instance data object available at this device pin
    #else
    .Objects.DAC             = NULL,                    ///< (not available)
    #endif
    #if (P33C_I2C_COUNT > 0)
    .Objects.I2C             = NULL,                    ///< Pointer to I2C interface peripheral instance data object available at this device pin
    #endif
    #if (P33C_OPA_COUNT > 0)
    .Objects.OPA             = NULL,                    ///< Pointer to Op-Amp instance data object available at this device pin
    #endif
    #if (P33C_PGA_COUNT > 0)
    .Objects.PGA             = NULL,                    ///< Pointer to Programmable Gain Amplifier instance data object available at this device pin
    #endif
    #if (P33C_PG_COUNT > 0)
    .Objects.PG              = NULL,                    ///< Pointer to PWM Generator peripheral instance data object available at this device pin
    #endif
    #if (P33C_SPI_COUNT > 0)
    .Objects.SPI             = NULL,                    ///< Pointer to SPI interface peripheral instance data object available at this device pin
    #endif
    .Methods.Get            = &__builtin_RD11_Get,      ///< Gets the most recent pin state (either logic HIGH = 1 or LOW = 0)
    .Methods.Set            = &__builtin_RD11_Set,      ///< Sets the most recent pin state to logic HIGH
    .Methods.Clear          = &__builtin_RD11_Clear,    ///< Sets the most recent pin state to logic LOW
    .Methods.Toggle         = &__builtin_RD11_Toggle,   ///< Toggles the most recent pin state
    .Methods.SetInput       = &__builtin_RD11_SetInput, ///< Sets the pin direction to high impedance input (no state change)
    .Methods.SetOutput      = &__builtin_RD11_SetOutput, ///< Sets the pin direction to low impedance output (no state change)
    .Methods.SetState       = &__builtin_RD11_SetState, ///< Sets the pin direction to low impedance output (no state change)
    .Methods.Init           = &__builtin_RD11_Init,     ///< Initializes the pin setting direction (TRIS = d) and initial state (LAT = s)
    .Methods.Dispose        = &__builtin_RD11_Dispose,  ///< Sets the pin to high impedance input (RESET default)
    .Methods.GetOpenDrain   = &__builtin_RD11_GetOpenDrain, ///< Gets the pin open drain mode
    .Methods.SetOpenDrain   = &__builtin_RD11_SetOpenDrain, ///< Sets the pin open drain mode
    .Methods.GetPullUp      = &__builtin_RD11_GetPullUp, ///< Gets the connection state of the pin's pull up resistor
    .Methods.SetPullUp      = &__builtin_RD11_SetPullUp, ///< Sets the connection state of the pin's pull up resistor
    .Methods.GetPullDown    = &__builtin_RD11_GetPullDown, ///< Gets the connection state of the pin's pull down resistor
    .Methods.SetPullDown    = &__builtin_RD11_SetPullDown, ///< Sets the connection state of the pin's pull down resistor
    .Methods.SetAnalog      = &__builtin_RD11_SetAnalog, ///< Enable analog functions of this pin
    .Methods.SetDigital     = &__builtin_RD11_SetDigital ///< Disable analog functions of this pin
};
#endif // declarations of pin RD11

